/*Написати функцію pow(x,y) яка буде приймати 2 числа, перше - це число яке ми будемо зводити у ступінь, друге - у яку ступінь.
Наприклад pow(2,3) функція поверне значення 8, тобто два в кубі. 
Умови виконання ДЗ:
Не використовувати **
Не використовувати функції або інші матеріали, які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки */

function pow(x, y) {
  let result = 1;

  for (let i = 0; i < y; i++) {
    result *= x;
  }

  return result;
}

// приклади використання
console.log(pow(2, 3)); // 8
console.log(pow(5, 2)); // 25
console.log(pow(3, 4)); // 81
