/*Необхідно написати програму, яка буде виводити інформацію за умовами, при яких число виводитиметься з правильним словом: "рік", "роки" або "років" (тобто "29 років" чи "4 роки").

Умови виконання ДЗ:

Рік отримувати через prompt()
Зробити перевірку, що користувач ввів число, і це число не є відʼємним.
Не використовувати функції або інші матеріали, які ми не вивчали.
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки. */

let age = prompt('Скільки тобі років?');//Оголошення змінної,в якій зберігається рядок (текст), який вводить користувач у вікні prompt.
let realAge = Number(age);// Оголошення змінної, у яку записується числове значення перетвореного з рядка age.Number() намагається перевести рядок у число.
let mod10 = realAge % 10;// Оголошення змінної для знаходження останньої цифри числа, це необхідно для розуміння чи буде "рік", "роки", "років".
let mod100 = realAge % 100;// Оголошення змінної що знаходить останні дві цифри числа.Це важливо, бо числа 11–14 мають особливу форму ("років").

if (!isNaN(realAge) && Number.isInteger(realAge) && realAge > 0) { /* Перевіряємо, що realAge: не NaN (тобто дійсне число), є цілим числом, більше нуля (позитивне число) */
    if (mod10 === 1 && mod100 !== 11) { /* Якщо остання цифра числа дорівнює 1 і при цьому останні дві цифри не 11, виводимо: "<число> рік" */
        console.log(`${realAge} рік`);
    } else if (mod10 >= 2 && mod10 <= 4 && !(mod100 >= 12 && mod100 <= 14)) { /* Якщо остання цифра 2, 3 або 41 при цьому останні дві цифри не 12, 13 або 14, виводимо: "<число> роки" */
        console.log(`${realAge} роки`);
    } else {
        console.log(`${realAge} років`);/*В інших випадках (для 0, 5-20, 11-14, та всіх інших) виводимо: "<число> років" */
    }
} else {
    console.log("Упс...Будь ласка, введи ціле додатне число."); /*Якщо realAge не відповідає перевіркам (не число, дробове, або <= 0) */
}