/*Напишіть програму яка буде приймати два значення, перше це одиниця вимірювання (кілометри, години та кілограми), друге значення це кількість, а потім переводити ці значення:

кілометри - в метри
години - в хвилини
кілограми - в грами
Зробити вивід отриманої інформації у вигляді - "10 км це 10000 м" або "1 год це 60хв", або "1 кг це 1000 г". 

Умови виконання ДЗ:

В задачі не обовʼязково викорисутовувати prompt, просто запишіть значення в зміні.
Обовʼязково при написанні завдання використовуйте switch
Продумати варінат, якщо буде введена якась інша одиниця виміру
Мудрувати та створювати валідацію не потрібно */


let unit = "кілометри"; // додаємо змінну одиниці виміру із значенням кілометри, замість кілометри може бути години або кілограми
let amount = 10; // додаємо змінну із значенням числа, яке будемо конвертувати, наприклад в метри

switch (unit) { // дана конструкція порівнює значення змінної unit із переліком варіантів (гілок case).
    case "кілометри": // якщо unit дорівнює "кілометри, то виконується цей блок"
        console.log(`${amount} км це ${amount * 1000} м`);
        break;

    case "години":
        console.log(`${amount} год це ${amount * 60} хв`);
        break; // break обов’язково зупиняє виконання switch, щоб інші case не виконалися.

    case "кілограми":
        console.log(`${amount} кг це ${amount * 1000} г`);
        break;

    default: // запасний варіант, який виконається, якщо жоден з case не підійшов (наприклад, unit = "літри").
        console.log(`Невідома одиниця виміру`);
}
