/*Напишіть програму яка буде приймати два значення, перше це одиниця вимірювання (кілометри, години та кілограми), друге значення це кількість, а потім переводити ці значення:

кілометри - в метри
години - в хвилини
кілограми - в грами
Зробити вивід отриманої інформації у вигляді - "10 км це 10000 м" або "1 год це 60хв", або "1 кг це 1000 г". 

Умови виконання ДЗ:

В задачі не обовʼязково викорисутовувати prompt, просто запишіть значення в зміні.
Обовʼязково при написанні завдання використовуйте switch
Продумати варінат, якщо буде введена якась інша одиниця виміру
Мудрувати та створювати валідацію не потрібно */


function convert(unit, amount) {
    switch (unit) {
        case "кілометри":
            return `${amount} км це ${amount * 1000} м`;

        case "години":
            return `${amount} год це ${amount * 60} хв`;

        case "кілограми":
            return `${amount} кг це ${amount * 1000} г`;

        default:
            return "Невідома одиниця виміру";
    }
}
// Виклик функції і виведення результату окремо
let unit = "кілометри";
let amount = 10;

let result = convert(unit, amount);
console.log(result);
